// 问题 F: 21级期末机试-谍影寻踪（10分）
/*
    题目描述
    我方给情报组织中的每个人员一个唯一的代号。
    同时，情报人员为了隐秘，可能会有不同的姓名编号（设定最多两个姓名编号）。
    我方顺藤摸瓜，分别截获并返回组织信息。请你帮忙汇总并恢复这条组织链条。

    输入
    多组样例。每组样例包括多行输入
    第一行包含一个正整数n（0<n≤1000），表示截获到的情报数
    接下来的n行输入形式为A->B，表示A单向联系B，B是A的下线。
    A和B表示两名组织人员的信息，包括代号x和姓名编号y，用逗号“,”分开。
    代号x和姓名编号y为整数，满足1≤x,y≤999999。除了第一行，A或B的代号信息在之前的行中出现过。
    输出
    对于每一组样例，按照顺序在一行中输出该组织的所有成员的信息，用“->”间隔。
    每个输出占一行。如果有一个代号有两个姓名编号，则认为是一个成员，输出代号和对应的两个姓名编号，用“#”分开。如有两个信息1,2345和1,6666，输出时对应一个成员信息1,2345#6666，两个姓名编号先输入的在前面。

    样例输入
    3
    1,1234->5,2236
    5,2236->3,7177 
    7,3234->1,1234
    4
    1,258->10,111111
    5,4353->1,36900 
    7,22->5,4353
    10,159->20,220102
    2
    1,111->2,222
    1,101->2,202
    样例输出
    7,3234->1,1234->5,2236->3,7177 
    7,22->5,4353->1,258#36900->10,111111#159->20,220102
    1,111#101->2,222#202
*/

#include<stdio.h>
#include<string.h>

struct spy{

  int x;
  int y;
  int next;
  int last;
} spy[100007];

int main(){

    int n;
    
    while(scanf("%d", &n)!=EOF){
            
        memset(spy, 0, sizeof(spy));
        
        for(int i=1; i<=n; i++){

            int x1, x2, y1, y2;

            scanf("%d,%d->%d,%d", &x1, &y1, &x2, &y2);

            spy[x1].next = x2;
            spy[x2].last = spy[x1].last + 1;

            if(spy[x1].x==0)
                spy[x1].x = y1;
            else if(spy[x1].x!=y1)
                spy[x1].y = y1;
            
            if(spy[x2].x==0)
                spy[x2].x = y2;
            else if(spy[x2].x!=y2)
                spy[x2].y = y2;
        }

        int t;
        
        for(int i=1; i<=999999; i++){

            if(spy[i].last==0 && spy[i].x>0){

                t=i;
                break;
            }
        }

        while(t>0){

            if(spy[t].y==0 && spy[t].next!=0){

                printf("%d,%d->", t, spy[t].x);
            }
            else if(spy[t].y!=0 && spy[t].next!=0){

                printf("%d,%d#%d->", t, spy[t].x, spy[t].y);
            }

            if(spy[t].next==0 && spy[t].y==0){

                printf("%d,%d", t, spy[t].x);
            }
            else if(spy[t].next==0 && spy[t].y!=0){

                printf("%d,%d#%d", t, spy[t].x, spy[t].y);
            }

               t = spy[t].next;
        }

        printf("\n");
    }
    
    return 0;
}