//石子游戏
/*
    题目描述
    hx073269和PIPI玩起了石子游戏。
    一共有n堆石子，第i堆石子有ai个，两人轮流操作。
    每个人每个回合只能对一堆石子进行操作，
    hx073269每次操作只能拿偶数个石子，PIPI每次操作只能拿奇数个石子， 
    每次操作至少拿走一个石子，直到一方无法进行任何操作，无法操作的人失败。

    假设hx073269与PIPI都是绝顶聪明的，由hx073269先手。如果hx073269可以获胜，那么输出YES，否则输出NO。
    
    输入
    第一行输入一个正整数n，n<=10^6。
    接下来n个正整数，第i个数表示ai，ai<=10^9。
    输出
    若hx073269能够获胜，则输出YES，否则输出NO。
    
    样例输入
    2
    2
    1
    样例输出
    NO
*/

#include<stdio.h>

int main(){

    int n;

    scanf("%d", &n);

    for(int i=0; i<n; i++){

        int i;
        
        scanf("%d", &i);
    }

    return 0;
}