//问题 C: 日期之差
/*
    题目描述
    给定同一年的两个日期，计算两个日期之差。
    此题对闰年的判定规则为： 若某年份是 4 的倍数且不是 100 的倍数，或者该年份是 400 的倍数，则该年份是闰年。

    输入
    多组数据。 每组输入一行，包含两个日期，日期之间用一个空格隔开。 
    一个日期包含年月日，形式为 "yyyy-mm-dd"。 
    数据保证每组输入的两个日期合法且年份相同。
    文件以EOF结束。
    输出
    每组输出一行，包含一个整数，表示两个日期之间相差的天数。
    
    样例输入
    2100-02-28 2100-03-01
    2077-03-31 2077-01-31
    样例输出
    1
    59
    提示
    一年只有三百多天，思考使用函数实现枚举每一天的方式。
*/

#include<stdio.h>

// 一般
int main(){

    int y1, m1, d1, y2, m2, d2;

    while(scanf(""))

    return 0;
}

// 枚舉